{
    "work": [
        {
            "id": 1,
            "img": "/logos/op.jpg",
            "heading": "Optima 2025 Website Backend",
            "overview": "Developed a Express.js backend for participant management and admin operations of the fest using role-based access control dashboard.",
            "desc": "Designed REST APIs for participant registration, login, password reset (NodeMailer), & for all admin dashboard tasks. Implemented JWT, Helmet, Morgan, compression and rate-limiting for enhanced security and performance. Dockerised and set up CI/CD Pipelines using GitHub Actions for deployments onto Azure and Vercel for backup.",
            "linktype": "Website",
            "link": "https://smartev.vercel.app/",
            "duration": "Jan'24 - Apr'24"
        },
        {
            "id": 2,
            "img": "/logos/pmsm.jpg",
            "heading": "Real-Time Sensor Data Monitoring and Control Dashboard",
            "overview": "Web Platform to monitor Health, Fault and Service History for an EV. Built under the guidance of Prof. Mamata Jenamani, IIT Kharagpur",
            "desc": "Created APIs in Flask for all functionalities - user sign-in, sign-up, fault diagnosis and diagnostic report retrieval. Applied JWT for secure authentication and utilized the bcrypt library for password hashing in the application. Dockerised and deployed the platform on Ubuntu Server & implemented CI/CD Pipelines using GitHub Actions.",
            "linktype": "Website",
            "link": "https://smartev.vercel.app/",
            "duration": "Jan'24 - Apr'24"
        },
        {
            "id": 3,
            "img": "/logos/op.jpg",
            "heading": "Optima 2023 Website",
            "overview": "Website for Optima 2023, IIT Kharagpur.",
            "desc": "Built a responsive and SEO-friendly website for the fest using React.js, GoogleApp Script, Bootstrap and Vercel. Used React functionalities like useState, useEffect, localStorage, arrays, maps; AOS Library for scroll animations. Added Google Analytics to the website; received 36000+ views, handled 650+ registrations and 250 payments.",
            "linktype": "Website",
            "link": "https://2023.optima.org.in/",
            "duration": "Aug'23 - Sep'23"
        }
    ]
}